[
  {
    "id": "m1",
    "title": "Bawaal",
    "description": "Ajay Dixit, an ordinary history teacher in a high school, enjoys mini celebrityhood in his town courtesy the fake image he has built. He shares a strained relationship with his newly-wed wife. Circumstances force him to take a trip to Europe for the World War 2 trail accompanied by his wife. Will his relationship with his wife survive this trip? Will he manage to win the war within?",
    "genres": "Romance, Drama, Action",
    "starring": [
      "Varun Dhawan",
      "Janhvi Kapoor",
      "Manoj Pahwa",
      "Mukesh Tiwari",
      "Aparna Ghoshal",
      "Anjuman Saxena",
      "Prateik Pachori"
    ],
    "posterImg": "https://qqcdnpictest.mxplay.com/pic/6a84f5380b2b1e61ace0a641113bf473/en/2x3/208x312/b4f879e3a2b48bf705b8e0adb563c44e_1280x1920_badged_1761109223954.webp",
    "platforms": [
      {
        "platformId": "MXPlayer",
        "watchLink": "https://www.mxplayer.in/movie/watch-bawaal-movie-online-6a84f5380b2b1e61ace0a641113bf473?watch=true"
      }
    ]
  },
  {
    "id": "m2",
    "title": "Bholaa",
    "description": "Bholaa, an ex-convict, endeavours to meet his daughter for the first time after being released from prison. However his plans were interrupted by a well-orchestrated drug bust. His journey begins with an extraordinary encounter, and is littered with strange difficulties with death lurking around every turn. Things aren't as simple as they appear. Will he be able to meet his daughter?",
    "genres": "Action, Drama",
    "starring": [
      "Ajay Devgn",
      "Tabu",
      "Deepak Dobriyal",
      "Sanjay Mishra",
      "Vineet Kumar",
      "Amala Paul",
      "Gajraj Rao",
      "Kiran Kumar",
      "Makrand Deshpande",
      "Tarun Gahlot"
    ],
    "posterImg": "https://qqcdnpictest.mxplay.com/pic/048583d8c50235757c926f6b9dc75e6c/en/2x3/208x312/test_pic1749480794937.webp",
    "platforms": [
      {
        "platformId": "MXPlayer",
        "watchLink": "https://www.mxplayer.in/movie/watch-bholaa-movie-online-048583d8c50235757c926f6b9dc75e6c?watch=true"
      }
    ]
  },
  {
    "id": "m3",
    "title": "Satyaprem Ki Katha",
    "description": "Sattu is a good hearted but good for nothing LLB fail guy who dreams of marrying the IT girl of Ahmedabad Katha, a girl way out of his league. However fate has other plans and Katha and he end up getting married, much to Katha’s dismay. From here on starts Sattu’s tryst to make his wife fall in love with him and how while doing so, he ends up discovering himself and proves to be a worthy husband!",
    "genres": "Romance, Drama",
    "starring": [
      "Kartik Aaryan",
      "Kiara Advani",
      "Gajraj Rao",
      "Siddharth Randeria",
      "Rajpal Yadav",
      "Supriya Pathak Kapur",
      "Shikha Talsania",
      "Anooradha Patel",
      "Nirrmite Saawaant",
      "Maira Doshi",
      "Bhaumik Ahir"
    ],
    "posterImg": "https://qqcdnpictest.mxplay.com/pic/2c798dfbf33e7f20f43ac17c56ab7fe1/en/2x3/208x312/cc9038ba3c8dff105f6946666576f2d3_2000x3000_badged_1760590830836.webp",
    "platforms": [
      {
        "platformId": "MXPlayer",
        "watchLink": "https://www.mxplayer.in/movie/watch-satyaprem-ki-katha-movie-online-2c798dfbf33e7f20f43ac17c56ab7fe1?watch=true"
      }
    ]
  },
  {
    "id": "m4",
    "title": "Ram Setu",
    "description": "Watch Ram Setu Hindi Movie Online on Amazon MX Player for Free! Dr. Aryan Kulshreshtha, an atheist archaeologist, decides to go on a journey that challenges his scientific convictions and uncovers the intersection of history and mythology. Initially celebrated for uncovering ancient treasures in Afghanistan, Aryan’s reputation crumbles after he submits a report questioning the Ramayana's authenticity, causing public outrage. Recruited by businessman Indrakant to investigate the origins of Ram Setu, Aryan, along with Dr. Sandra Rebello and Dr. Gabrielle, discovers that the structure is not only ancient but potentially man-made, dating back to Rama's era. What will happen next? To find out what happens next, stay tuned to Amazon MX Player. Catch Ram Setu full movie, and download Ram Setu on Amazon MX Player app for free!",
    "genres": "Action, Adventure",
    "starring": [
      "Akshay Kumar",
      "Jacqueline Fernandez",
      "Nasser",
      "Nushrratt Bharuccha",
      "Pravessh Rana",
      "Satya Dev",
      "A",
      "Shweta Kawaatra"
    ],
    "posterImg": "https://qqcdnpictest.mxplay.com/pic/8f9eb2b9dc634c8efe15be770eebfd1e/en/2x3/208x312/test_pic1736411119303_badged_1760590827844.webp",
    "platforms": [
      {
        "platformId": "MXPlayer",
        "watchLink": "https://www.mxplayer.in/movie/watch-ram-setu-movie-online-8f9eb2b9dc634c8efe15be770eebfd1e?watch=true"
      }
    ]
  },
  {
    "id": "m5",
    "title": "Drishyam 2 (Hindi)",
    "description": "Watch Drishyam 2 Hindi Movie Online on Amazon MX Player for Free! Seven years after covering up Sam’s accidental murder, Vijay Salgaonkar leads a quiet life, but the ghosts of his past refuse to rest. The Salgaonkar family appears to have moved on, yet Anju suffers from PTSD, and whispers about her alleged relationship with Sam threaten their peace. However, IG Tarun Ahlawat reopens the case, determined to crack Vijay’s meticulously constructed alibi. With the help of undercover cops Jenny and Shiv, the police uncover damning evidence, including a voice recording of Nandini’s confession. Will Vijay be able save his family this time? To find out what happens next, stay tuned to Amazon MX Player. Catch Drishyam 2 full movie, and Drishyam 2 movie download on Amazon MX Player app for free!",
    "genres": "Crime, Drama",
    "starring": [
      "Ajay Devgn",
      "Shriya Saran",
      "Tabu",
      "Akshaye Khanna",
      "Ishita Dutta",
      "Rajat Kapoor",
      "Neha Joshi",
      "Saurabh Shukla",
      "Kamlesh Sawant",
      "Mrunal Jhadav"
    ],
    "posterImg": "https://qqcdnpictest.mxplay.com/pic/2c580670b2104d156e2d9a3fd42a413e/en/2x3/208x312/test_pic1736411396725_badged_1760590835692.webp",
    "platforms": [
      {
        "platformId": "MXPlayer",
        "watchLink": "https://www.mxplayer.in/movie/watch-drishyam-2-hindi-movie-online-2c580670b2104d156e2d9a3fd42a413e?watch=true"
      }
    ]
  },
  {
    "id": "m6",
    "title": "Pushpa: The Rise (Hindi)",
    "description": "Watch Pushpa: The Rise Movie in Hindi Online on Amazon MX Player for Free! Pushpa: The Rise follows the story of Pushpa Raj, a laborer in the late 1990s who rises to power in the illegal red sandalwood smuggling business. Initially working as a low-level woodcutter, Pushpa and his friend Kesava enter the dangerous world of smuggling under the rule of Konda Reddy. With his quick wit and fearless nature, Pushpa quickly climbs the ranks, gaining Konda’s trust while evading the relentless DSP Govindappa. However, his success earns him the jealousy of Konda’s younger brother, Jaali, who despises Pushpa's growing influence. Will Pushpa continue to rise or will Jaali end everything for Pushpa? To find out what happens next, stay tuned to Amazon MX Player. Catch Pushpa 1 movie in Hindi, and download Pushpa full movie on Amazon MX Player app for free!",
    "genres": "Action, Crime, Drama, South-Dubbed",
    "starring": [
      "Allu Arjun",
      "Rashmika Mandanna",
      "Fahadh Faasil"
    ],
    "posterImg": "https://qqcdnpictest.mxplay.com/pic/c2dc7967b20d067c12227043915c9f84/en/2x3/208x312/test_pic1738057924296_badged_1760590824763.webp",
    "platforms": [
      {
        "platformId": "MXPlayer",
        "watchLink": "https://www.mxplayer.in/movie/watch-pushpa-the-rise-hindi-movie-online-c2dc7967b20d067c12227043915c9f84?watch=true"
      }
    ]
  },
  {
    "id": "m7",
    "title": "The Amazing Spider-Man",
    "description": "Peter Parker is going back to high school in The Amazing Spider-Man (3D) as a teenager dealing with both contemporary human problems and amazing super-human crises.",
    "genres": "Adventure, Action, Drama, Hollywood-Dubbed, Dubbed",
    "starring": [
      "Irrfan Khan",
      "Chris Zylka",
      "Embeth Davidtz",
      "Martin Sheen",
      "Denis Leary",
      "Emma Stone",
      "Andrew Garfield",
      "Rhys Ifans",
      "Sally Field",
      "Campbell Scott"
    ],
    "posterImg": "https://qqcdnpictest.mxplay.com/pic/19a6dbd95f01fe6e8518aface4fe9fb1/en/2x3/208x312/0b8b7d9037e2364b96eaa3664d3c21de_1280x1920.webp",
    "platforms": [
      {
        "platformId": "MXPlayer",
        "watchLink": "https://www.mxplayer.in/movie/watch-the-amazing-spiderman-movie-online-19a6dbd95f01fe6e8518aface4fe9fb1?watch=true"
      }
    ]
  },
  {
    "id": "m8",
    "title": "Varisu (Hindi)",
    "description": "Watch Varisu Hindi Dubbed Movie Online on Amazon MX Player for Free! Vijay, the youngest son of billionaire entrepreneur Rajendran Palanisamy, chooses passion over tradition, launching a food delivery startup instead of joining the family business. His decision leads to estrangement, and he is cast out of the family. Seven years later, Rajendran is diagnosed with terminal cancer and faces the daunting task of choosing his successor among his two elder sons, Jai and Ajay, both of whom are embroiled in personal and professional turmoil. Jai’s infidelity and negligence of his family, along with Ajay’s betrayal and massive debt, leave Rajendran disillusioned. Meanwhile, Vijay returns home at his mother Sudha’s request, only to find his family falling apart. What will happen next? To find out what happens next, stay tuned to Amazon MX Player. Catch Varisu full movie in Hindi, and Varisu Hindi movie download on Amazon MX Player app for free!",
    "genres": "Drama",
    "starring": [
      "Vijay",
      "Rashmika Mandanna",
      "R. Sarathkumar",
      "Jayasudha",
      "Srikanth",
      "Shaam"
    ],
    "posterImg": "https://qqcdnpictest.mxplay.com/pic/04c78559cceaaa49ec1ce2764a5cd331/en/2x3/208x312/test_pic1741152129773_badged_1760590821708.webp",
    "platforms": [
      {
        "platformId": "MXPlayer",
        "watchLink": "https://www.mxplayer.in/movie/watch-varisu-hindi-movie-online-04c78559cceaaa49ec1ce2764a5cd331?watch=true"
      }
    ]
  },
  {
    "id": "m9",
    "title": "Satyameva Jayate 2",
    "description": "Satyameva Jayate 2 revolves around the fight against injustice and misuse of power. From police and politicians to industrialists and a common man, the film will explore corruption in all spheres.",
    "genres": "Drama, Action",
    "starring": [
      "John Abraham",
      "Nora Fatehi",
      "Divya Khosla Kumar",
      "Anup Soni",
      "Palak Singh",
      "Harsh Chhaya",
      "Bhagyashree Limaye",
      "Daya Shankar Pandey",
      "Shaad Randhawa",
      "Gautami Kapoor"
    ],
    "posterImg": "https://qqcdnpictest.mxplay.com/pic/c96205f4070baab89af6a34467a528dd/en/2x3/208x312/c43547f635e80f573d4e8ff46be70565_2000x3000.webp",
    "platforms": [
      {
        "platformId": "MXPlayer",
        "watchLink": "https://www.mxplayer.in/movie/watch-satyameva-jayate-2-movie-online-c96205f4070baab89af6a34467a528dd?watch=true"
      }
    ]
  },
  {
    "id": "m10",
    "title": "The Amazing Spider-Man 2",
    "description": "Watch The Amazing Spider Man 2 Hindi Dubbed Movie Online on Amazon MX Player for Free! Peter Parker continues his journey as Spider-Man, struggling with his promise to keep away from Gwen Stacy after her father’s death. Meanwhile, Oscorp engineer Max Dillon, an insecure and overlooked man, gains electrical powers in a lab accident and transforms into Electro. At the same time, Peter's childhood friend, Harry Osborn, returns to learn he has inherited a terminal illness from his father, Norman Osborn. Hoping to find a cure, Harry believes Spider-Man's blood could save him, but Peter refuses, fearing unpredictable consequences. To find out what happens next, stay tuned to Amazon MX Player. Catch The Amazing Spider Man 2 full movie in Hindi, and The Amazing Spider Man 2 Hindi movie download on Amazon MX Player app for free!",
    "genres": "Adventure, Action, Drama, Hollywood-Dubbed, Dubbed",
    "starring": [
      "Embeth Davidtz",
      "Jamie Foxx",
      "Marton Csokas",
      "Dane DeHaan",
      "Felicity Jones",
      "Emma Stone",
      "B.J. Novak",
      "Sally Field",
      "Louis Cancelmi",
      "Campbell Scott",
      "Colm Feore",
      "Andrew Garfield",
      "Paul Giamatti",
      "Max Charles"
    ],
    "posterImg": "https://qqcdnpictest.mxplay.com/pic/bc85356f6c1eecd3673d1d58d592c819/en/2x3/208x312/test_pic1737362341944.webp",
    "platforms": [
      {
        "platformId": "MXPlayer",
        "watchLink": "https://www.mxplayer.in/movie/watch-the-amazing-spiderman-2-movie-online-bc85356f6c1eecd3673d1d58d592c819?watch=true"
      }
    ]
  },
  {
    "id": "m11",
    "title": "Bachchhan Paandey",
    "description": "Watch Bachchhan Paandey Hindi Movie Online on Amazon MX Player for Free! Myra Devekar, an aspiring filmmaker, wants to make a gripping gangster biopic, and her search for a compelling subject leads her to the infamous Bachchhan Paandey of Baghwa. Ruthless and feared, he rules the criminal underworld with an iron fist. Accompanied by her friend Vishu, Myra secretly gathers information on him, but their plans go awry when they get caught. Just as Bachchhan is about to kill them, he agrees to let Myra live on one condition: she must tell his story. As Myra delves into his past, she uncovers a side of him that few have seen. Once a regular man, Bachchhan’s transformation into a feared gangster was driven by tragedy and betrayal. What happened to Bachchhan Paandey that he became the most feared gangster in Baghwa? To find out what happens next, stay tuned to Amazon MX Player. Catch Bachchhan Paandey full movie, and Bachchhan Paandey movie download on Amazon MX Player app for free!",
    "genres": "Action, Drama, Comedy",
    "starring": [
      "Akshay Kumar",
      "Kriti Sanon",
      "Jacqueline Fernandez",
      "Arshad Warsi",
      "Pankaj Tripathi",
      "Prateik Babbar",
      "Sanjay Mishra",
      "Abhimanyu Singh",
      "Snehal Dabi",
      "Saharsh Kumar Shukla"
    ],
    "posterImg": "https://qqcdnpictest.mxplay.com/pic/27e821ee1b5b74c34cbcf97a650cf2bd/en/2x3/208x312/test_pic1743154002610.webp",
    "platforms": [
      {
        "platformId": "MXPlayer",
        "watchLink": "https://www.mxplayer.in/movie/watch-bachchhan-paandey-movie-online-27e821ee1b5b74c34cbcf97a650cf2bd?watch=true"
      }
    ]
  },
  {
    "id": "m12",
    "title": "Marjaavaan",
    "description": "Watch Marjaavaan Hindi Movie Online on Amazon MX Player for Free! Marjaavaan is an intense tale of love, loyalty, and revenge, set in the grimy underbelly of Mumbai’s water mafia. Raghu, a loyal enforcer who works for the powerful Narayan Anna, finds his life upended when he falls in love with Zoya, a mute Kashmiri girl who loves music,is a singer and likes to spreads joy in everyone's life. Their love story becomes a target of Vishnu, Anna’s envious son, who is consumed by his inferiority complex because of his small height, and thirst for power. He wants to take everything from Raghu as his father prefers Raghu over his own son. Will Raghu be able to save the people he cares about? How far will Vishnu go to hurt Raghu? To find out what happens next, stay tuned to Amazon MX Player. Catch Marjaavaan full movie, and Marjaavaan movie download on Amazon MX Player app for free!",
    "genres": "Action, Romance, Drama",
    "starring": [
      "Riteish Deshmukh",
      "Sidharth Malhotra",
      "Tara Sutaria",
      "Rakul Preet Singh"
    ],
    "posterImg": "https://qqcdnpictest.mxplay.com/pic/816e06add5f7ae65d996d3ec15cebe0c/en/2x3/208x312/test_pic1740042021191_badged_1760590838797.webp",
    "platforms": [
      {
        "platformId": "MXPlayer",
        "watchLink": "https://www.mxplayer.in/movie/watch-marjaavaan-movie-online-816e06add5f7ae65d996d3ec15cebe0c?watch=true"
      }
    ]
  },
  {
    "id": "m13",
    "title": "Bell Bottom",
    "description": "Watch Bell Bottom Hindi Movie Online on Amazon MX Player for Free! Set in 1984, Bell Bottom follows RAW agent Anshul Malhotra, codenamed Bell Bottom, who is tasked with rescuing passengers of a hijacked Indian Airlines flight. The incident marks the seventh hijacking in India in five years, and previous negotiations have always ended in surrender to the terrorists’ demands. With a personal vendetta stemming from his mother’s death during an earlier hijacking, Anshul uses his sharp intelligence to uncover that the terrorists are backed by Pakistan’s ISI. To find out what happens next, stay tuned to Amazon MX Player. Catch Bell Bottom film, and Bell Bottom full movie download on Amazon MX Player app for free!",
    "genres": "Action",
    "starring": [
      "Akshay Kumar",
      "Lara Dutta",
      "Huma Qureshi",
      "Vaani Kapoor",
      "Adil Hussain",
      "Denzil Smith",
      "Dolly Ahluwalia"
    ],
    "posterImg": "https://qqcdnpictest.mxplay.com/pic/7da7a2cbf100daaa21be2f03fec368f1/en/2x3/208x312/test_pic1733756975142.webp",
    "platforms": [
      {
        "platformId": "MXPlayer",
        "watchLink": "https://www.mxplayer.in/movie/watch-bell-bottom-movie-online-7da7a2cbf100daaa21be2f03fec368f1?watch=true"
      }
    ]
  },
  {
    "id": "m14",
    "title": "Jumanji: The Next Level",
    "description": "Watch Jumanji The Next Level Hindi Dubbed Movie Online on Amazon MX Player for Free! Spencer, feeling lost after his first semester of college, re-enters the dangerous world of Jumanji, longing for the confidence his avatar, Dr. Smolder Bravestone, once gave him. When he fails to meet his friends as planned, Martha, Fridge, and Bethany go looking for him. However, the game unexpectedly pulls in Spencer’s grandfather Eddie and his old friend Milo. With new avatars and an unfamiliar game scenario, the group must recover the stolen Falcon Jewel to end a devastating drought in Jumanji. Eddie, reckless and overconfident, causes several setbacks, while Milo's slow explanations frustrate the group. Will they survive Jumanji this time? To find out what happens next, stay tuned to Amazon MX Player. Catch Jumanji The Next Level full movie in Hindi, and Jumanji The Next Level Hindi movie download on Amazon MX Player app for free!",
    "genres": "Action, Adventure, Comedy, Hollywood-Dubbed, Dubbed",
    "starring": [
      "Dwayne Johnson",
      "Jack Black",
      "Kevin Hart",
      "Karen Gillan",
      "Rory McCann",
      "Alex Wolff",
      "Danny Glover",
      "Colin Hanks",
      "Nick Jonas",
      "Awkwafina",
      "Morgan Turner",
      "Ser'Darius Blain",
      "Madison Isema",
      "Danny DeVito",
      "Rhys Darby",
      "Bebe Neuwirth"
    ],
    "posterImg": "https://qqcdnpictest.mxplay.com/pic/bce7ae02445dad432bdab581e180ceef/en/2x3/208x312/d5f863cd13cc307123989701f8b72fdf_1280x1920.webp",
    "platforms": [
      {
        "platformId": "MXPlayer",
        "watchLink": "https://www.mxplayer.in/movie/watch-jumanji-the-next-level-movie-online-bce7ae02445dad432bdab581e180ceef?watch=true"
      }
    ]
  }
]